schreibfaul1/ESP32-MiniWebRadio/src/common.h
    ps_ptr<char> myLog;

    if (newLine) {
        newLine = false;
        myLog.assign("\n");
    } else {
        myLog.assign("");
    }

    rtc.hasValidTime() ? myLog.append(rtc.gettime_s()) : myLog.append("00:00:00");
    myLog.append(" ");
    myLog.appendf(fmt, std::forward<Args>(args)...);
    myLog.append("\033[0m\r\n");
    printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std::move(myLog));
    myLog.reset();
}

template <typename... Args> void SerialPrintfcr(const char* fmt, Args&&... args) {
    if (s_logBuffer.size() == 1024) s_logBuffer.pop_back();

    ps_ptr<char> myLog;

    if (newLine) {
        newLine = false;
        myLog.assign("\n");
    } else {
        myLog.assign("");
    }

    rtc.hasValidTime() ? myLog.append(rtc.gettime_s()) : myLog.append("00:00:00");
    myLog.append(" ");
    myLog.appendf(fmt, std::forward<Args>(args)...);
    myLog.append("\033[0m\r");
    printf("%s", myLog.c_get());
    s_logBuffer.insert(s_logBuffer.begin(), std::move(myLog));
    myLog.reset();
}

int log_redirect_handler(const char* format, va_list args) {
    va_list args_len;
    va_copy(args_len, args);
    char probe[1];
    int  len = vsnprintf(probe, sizeof(probe), format, args_len);
    va_end(args_len);
    if (len < 0) return 0;
    len += 1;
    // Puffer fuer die formatierte Nachricht
    ps_ptr<char> log_buffer;
    log_buffer.alloc(len);
    char* log_dst = log_buffer.get();
    if (!log_dst) return 0;
    va_list args_msg;
    va_copy(args_msg, args);
    vsnprintf(log_dst, len, format, args_msg);
    va_end(args_msg);
    if (len > 0) {
        int idx = log_buffer.index_of("ARDUINO:");
        if (idx > 0) {
            // log_buffer.println();
            char c = log_buffer[0];
            log_buffer.remove_before(idx, true);
            log_buffer.insert(" .. ", 8);
            if (c == 'E') log_buffer.insert(ANSI_ESC_RED, 11);
            if (c == 'W') log_buffer.insert(ANSI_ESC_YELLOW, 11);
            if (c == 'I') log_buffer.insert(ANSI_ESC_GREEN, 11);
            if (c == 'D') log_buffer.insert(ANSI_ESC_CYAN, 11);
            if (c == 'V') log_buffer.insert(ANSI_ESC_GREY, 11);
            log_buffer.truncate_at(log_buffer.strlen() - 1); // remove '\n'
            SerialPrintfln("{}", log_buffer.c_get());
        } else {
            SerialPrintfln("{}", log_buffer.c_get());
        }
    }
    return 0;
}

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
struct dlnaHistory_s {
    ps_ptr<char> objId;
    ps_ptr<char> name;
    int16_t      maxItems = -1;
    int16_t      childCount = -1;
};
struct releasedArg {
    ps_ptr<char> arg1;
    ps_ptr<char> arg2;
    ps_ptr<char> arg3;
    int16_t      val1 = 0;
    int16_t      val2 = 0;
};
struct timecounter_s {
    uint8_t timer = 0;
    uint8_t factor = 2;
};
struct irButtons {
    int16_t val;
    char*   label;
};
struct settings_s {
    irButtons    irbuttons[45];
    uint8_t      numOfIrButtons = 0;
    ps_ptr<char> lastconnectedhost = {};
    ps_ptr<char> lastconnectedfile = {};
};

struct volume_s {
    uint8_t cur_volume = 21;
    uint8_t ringVolume = 21;
    uint8_t volumeAfterAlarm = 12;
    uint8_t volumeSteps = 21;
};

struct bt_emitter_s {
    bool         found = false;
    bool         connect = false;
    bool         enabled = false;
    bool         play = true; // play: true, pause: false
    uint8_t      volume = 0;
    ps_ptr<char> mode = {};
    ps_ptr<char> version = {};
};

struct tone_s {
    int16_t LP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t HP = 0;  // -40 ... +6 (dB)        audioI2S
    int16_t BAL = 0; // -16...0....+16         audioI2S
};

struct i2c_items_s {
    bool es8311_found = false;
    int  es8311_addr = -1;
    bool es7210_found = false;
    int  es7210_addr = -1;
    bool gt911_found = false;
    int  gt911_addr = -1;
    bool ft6x36u_found = false;
    int  ft6x36u_addr = -1;
    bool bh1750_found = false;
    int  bh1750_addr = -1;
};

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

// prototypes (main.cpp)
bool         SD_MMC_exists(const char* path);
boolean      defaultsettings();
void         updateSettings();
void         urldecode(char* str);
void         fall_asleep();
void         wake_up();
void         setRTC(ps_ptr<char> TZString);
boolean      isAlarm(uint8_t weekDay, uint8_t alarmDays, uint16_t minuteOfTheDay, int16_t* alarmTime);
boolean      copySDtoFFat(const char* path);
void         showStreamTitle(ps_ptr<char> streamTitle);
void         showLogoAndStationName(bool force);
void         showFileLogo(int8_t state, int8_t subState);
void         showFileName(const char* fname);
void         showPlsFileNumber();
void         showAudioFileNumber();
void         display_sleeptime(int8_t ud = 0);
boolean      drawImage(ps_ptr<char> path, uint16_t posX, uint16_t posY, uint16_t maxWidth = 0, uint16_t maxHeigth = 0);
boolean      isAudio(File file);
boolean      isAudio(const char* path);
boolean      isPlaylist(File file);
bool         connectToWiFi();
void         setWiFiCredentials(ps_ptr<char> ssid, ps_ptr<char> password);
ps_ptr<char> scaleImage(ps_ptr<char> path);
bool         detect_i2_c_devices(TwoWire* twi, int8_t sda, int8_t scl, i2c_items_s* i2c_items);
void         set_display_items();
bool         init_SD_card();
void         setVolume(uint8_t vol);
uint8_t      downvolume();
uint8_t      upvolume();
void         setStation(uint16_t sta);
const char*  getFlagPath(uint16_t station);
void         nextStation();
void         prevStation();
void         setStationByNumber(uint16_t staNr);
void         setStationViaURL(const char* url, const char* extension);
void         savefile(ps_ptr<char> fileName, uint32_t contentLength, ps_ptr<char> contenttype);
void         setI2STone();
ps_ptr<char> getI2STone();
void         SD_playFile(ps_ptr<char> pathWoFileName, const char* fileName);
void         SD_playFile(ps_ptr<char> path, uint32_t resumeFilePos = 0, bool showFN = true);
bool         SD_rename(const char* src, const char* dest);
bool         SD_newFolder(const char* folderPathName);
bool         SD_delete(const char* itemPath);
void         processPlaylist();
void         changeState(int8_t state, int8_t subState);
void         connecttohost(ps_ptr<char> host);
void         connecttoFS(const char* FS, const char* filename, uint32_t fileStartTime = 0);
void         stopSong();
void         placingGraphicObjects();
void         muteChanged(bool m);
void         setTimeCounter(uint8_t sec);
ps_ptr<char> get_WiFi_PW(const char* ssid);
void         my_audio_info(Audio::msg_t m);
void         on_dlna_client(const DLNA_Client::msg_s& msg);
void         on_kcx_bt_emitter(const KCX_BT_Emitter::msg_s& msg);
void         on_websrv(const WebSrv::msg_s& msg);
void         tp_pressed(uint16_t x, uint16_t y);
void         tp_long_pressed(uint16_t x, uint16_t y);
void         tp_moved(uint16_t x, uint16_t y);
void         tp_released(uint16_t x, uint16_t y);

// ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline const char* byte_to_binary(int8_t x) { // e.g. alarmdays
    static char b[9];
    b[0] = '\0';

